# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X 
# в массиве A[1..N]. Пользователь в первой строке вводит натуральное число 
# N – количество элементов в массиве. В последующих  строках записаны N целых 
# чисел Ai. Последняя строка содержит число X
# *Пример:*
#     1 2 3 4 5
#     3
#     -> 1
N = int(input("Введите количество элементов: "))
lst = list()
count = 0
if N > 0:
    for i in range(N):
        a = int(input(f"Введите число {i+1}: "))
        lst.append(a)
    X = int(input("Введите число которое нужно найти: "))
    for i in range(N):
        if lst[i] == X: count += 1
    print(f"Число X встречается {count} раз")