# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент 
# к заданному числу X. Пользователь в первой строке вводит натуральное число 
# N – количество элементов в массиве. В последующих  строках записаны N целых чисел Ai.
# Последняя строка содержит число X
# *Пример:*
#     1 2 3 4 5
#     6
#     -> 5
N = int(input("Введите количество элементов: "))
lst = list()
# min = 0
if N > 0:
    for i in range(N):
        a = int(input(f"Введите число {i+1}: "))
        lst.append(a)
    X = int(input("Задайте число X: "))
 
    
    print(f" Самый близкий по величине элемент: {min(lst, key=lambda x: abs(X - abs(x))) } ")